<?php
return [
    'Mer' => [
        'Version' => 'v1.0.0',
        //商戶號
        'MerCode' => '',
        //交易賬戶號
        'Account' => '',
        //商戶證書
        'MerCert' => '',
        //請求地址
        'PostUrl' => 'https://newpay.ips.com.cn/psfp-entry/gateway/payment.do',
        //服务器S2S通知页面路径
        'S2Snotify_url' => "http://zoropay.com/gateway/finish",
        //页面跳转同步通知页面路径
        'return_url' => "http://zoropay.com/gateway/finish",
        //156#人民币
        'Ccy' => "156",
        //GB中文
        'Lang' => "GB",
        //订单支付接口加密方式 5#订单支付采用Md5的摘要认证方式
        'OrderEncodeType' => "5",
        //返回方式 1#S2S返回
        'RetType' => "1",

        'MsgId' => ""
    ],
    'bank' => [
        '1100' => '工商银行',
        '1101' => '农业银行',
        '1102' => '招商银行',
        '1103' => '兴业银行',
        '1104' => '中信银行',
        '1107' => '中国银行',
        '1108' => '交通银行',
        '1109' => '浦发银行',
        '1110' => '民生银行',
        '1111' => '华夏银行',
        '1112' => '光大银行',
        '1113' => '北京银行',
        '1114' => '广发银行',
        '1115' => '南京银行',
        '1116' => '上海银行',
        '1117' => '杭州银行',
        '1118' => '宁波银行',
        '1119' => '邮储银行',
        '1120' => '浙商银行',
        '1121' => '平安银行',
        '1122' => '东亚银行',
        '1123' => '渤海银行',
        '1124' => '北京农商行',
        '1127' => '浙江泰隆商业银行',
        '1106' => '中国建设银行',
    ],
];
